jmeter-test/client_deliverables/performance_report_20250801/html_dashboard/statistics.json
{
  "6. Create New Post" : {
    "transaction" : "6. Create New Post",
    "sampleCount" : 22,
    "errorCount" : 22,
    "errorPct" : 100.0,
    "meanResTime" : 402.45454545454544,
    "medianResTime" : 526.0,
    "minResTime" : 178.0,
    "maxResTime" : 547.0,
    "pct1ResTime" : 539.2,
    "pct2ResTime" : 546.1,
    "pct3ResTime" : 547.0,
    "throughput" : 0.21448766695914984,
    "receivedKBytesPerSec" : 0.07708150531344449,
    "sentKBytesPerSec" : 0.0563449046992298
  },
  "3. View Post Details" : {
    "transaction" : "3. View Post Details",
    "sampleCount" : 30,
    "errorCount" : 30,
    "errorPct" : 100.0,
    "meanResTime" : 178.8666666666667,
    "medianResTime" : 179.0,
    "minResTime" : 177.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 180.9,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 181.0,
    "throughput" : 0.22794620469569182,
    "receivedKBytesPerSec" : 0.08191816731251424,
    "sentKBytesPerSec" : 0.06077081433781627
  },
  "1. User Login" : {
    "transaction" : "1. User Login",
    "sampleCount" : 34,
    "errorCount" : 34,
    "errorPct" : 100.0,
    "meanResTime" : 429.11764705882337,
    "medianResTime" : 181.0,
    "minResTime" : 176.0,
    "maxResTime" : 940.0,
    "pct1ResTime" : 715.0,
    "pct2ResTime" : 777.25,
    "pct3ResTime" : 940.0,
    "throughput" : 0.2028264461823887,
    "receivedKBytesPerSec" : 0.05288541126044705,
    "sentKBytesPerSec" : 0.052489265857747075
  },
  "4. Load Profile Feed" : {
    "transaction" : "4. Load Profile Feed",
    "sampleCount" : 30,
    "errorCount" : 30,
    "errorPct" : 100.0,
    "meanResTime" : 178.5333333333333,
    "medianResTime" : 178.0,
    "minResTime" : 177.0,
    "maxResTime" : 183.0,
    "pct1ResTime" : 180.0,
    "pct2ResTime" : 181.35,
    "pct3ResTime" : 183.0,
    "throughput" : 0.23391448086579547,
    "receivedKBytesPerSec" : 0.08406301656114525,
    "sentKBytesPerSec" : 0.06373255875152044
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 172,
    "errorCount" : 172,
    "errorPct" : 100.0,
    "meanResTime" : 284.41860465116275,
    "medianResTime" : 179.0,
    "minResTime" : 176.0,
    "maxResTime" : 940.0,
    "pct1ResTime" : 703.0,
    "pct2ResTime" : 708.7,
    "pct3ResTime" : 781.5900000000022,
    "throughput" : 1.0241631039287373,
    "receivedKBytesPerSec" : 0.3480903191280323,
    "sentKBytesPerSec" : 0.2723166238195329
  },
  "2. Load Home Feed" : {
    "transaction" : "2. Load Home Feed",
    "sampleCount" : 31,
    "errorCount" : 31,
    "errorPct" : 100.0,
    "meanResTime" : 178.48387096774198,
    "medianResTime" : 178.0,
    "minResTime" : 176.0,
    "maxResTime" : 181.0,
    "pct1ResTime" : 180.0,
    "pct2ResTime" : 180.4,
    "pct3ResTime" : 181.0,
    "throughput" : 0.20262762272043924,
    "receivedKBytesPerSec" : 0.07281930191515786,
    "sentKBytesPerSec" : 0.055010233511994244
  },
  "5. Add Like" : {
    "transaction" : "5. Add Like",
    "sampleCount" : 25,
    "errorCount" : 25,
    "errorPct" : 100.0,
    "meanResTime" : 368.84000000000003,
    "medianResTime" : 180.0,
    "minResTime" : 176.0,
    "maxResTime" : 719.0,
    "pct1ResTime" : 710.4,
    "pct2ResTime" : 716.6,
    "pct3ResTime" : 719.0,
    "throughput" : 0.21421716479298053,
    "receivedKBytesPerSec" : 0.07698429359747738,
    "sentKBytesPerSec" : 0.056273845048156024
  }
}